---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalElement.MaterialId
source: html/919f020c-953a-3d08-0743-57dc1d3dc398.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElement.MaterialId Property

Defines the Material Id for the Analytical Element.

## Syntax (C#)
```csharp
public ElementId MaterialId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The provided MaterialId is not supported
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null